todo-api/app/controllers/api/v1/todos_controller.rb

SELECT "todos".* FROM "todos"  ORDER BY completed ASC, id DESC
---
      def index
        respond_with(Todo.all.order("completed ASC").order("id DESC"))